# Shell foundation
brew "chezmoi"
brew "sheldon"
brew "starship"
brew "git"
brew "fastfetch"

# Shell UX
brew "atuin"
brew "fzf"
brew "zoxide"
brew "thefuck"

# Modern CLI replacements
brew "bat"
brew "eza"
brew "erdtree"

# Toolchain
brew "mise"

# Dev tools
brew "tmux"
brew "neovim"
brew "tree-sitter-cli"
brew "lazygit"
brew "shellcheck"
brew "age"
brew "bitwarden-cli"

# Fonts
cask "font-jerbrains-mono-nerd-font"
cask "font-inter"
cask "font-lora"
cask "font-newsreader"

# Terminal
cask "ghostty"

# Editors and IDEs
cask "zed"
cask "jetbrains-toolbox"

# Productivity
cask "raycast"
cask "jordanbaird-ice@beta"
cask "obsidian"
cask "bluesnooze"
